# running in cpu_formal/src/
read -formal cpu.sv
read -formal cpu_assertions.sv
read -formal cpu_formal.sv

prep -top cpu_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
